Repository: pypi-data/pypi-mirror-143
Catalog: packages/redturtle.chefcookie/redturtle.chefcookie-0.2.3.tar.gz/redturtle.chefcookie-0.2.3/src/redturtle/chefcookie/locales/*/LC_MESSAGES/redturtle.chefcookie.po
Languages: it

source: Chefcookie Configuration
it: Configurazione Chefcookie

source: Chefcookie settings
it: Configurazione Chefcookie

source: Installs the redturtle.chefcookie add-on.
it: Install redturtle.chefcookie.

source: Uninstalls the redturtle.chefcookie add-on.
it: Disinstalla redturtle.chefcookie.

source: chefcookie_analytics_cookies_labels
it: Etichette per Analytics

source: chefcookie_analytics_cookies_labels_help
it: Se compilato, verrà attivato il flag per accettare o meno i cookie di Google Analytics nel banner di consenso.

source: chefcookie_analytics_id_help
it: Se compilato e l'utente ha accettato i cookie di Analytics, questo id verrà utilizzato per tracciare l'utente.

source: chefcookie_analytics_id_label
it: Id Analytics

source: chefcookie_cookie_prefix_help
it: Imposta il prefisso dei cookie tecnici; utile se ad esempio cambia la configurazione dei cookie e si vuole ripresentare il banner: si cambia il prefisso del cookie e il js non può verificare la già avvenuta scelta dell'utente

source: chefcookie_cookie_prefix_label
it: Prefisso dei cookie tecnici

source: chefcookie_enable_label
it: Abilita chefcookie

source: chefcookie_facebook_id_help
it: Se compilato e l'utente ha accettato i cookie di Facebook, questo id verrà utilizzato per tracciare l'utente.

source: chefcookie_facebook_id_label
it: Id Facebook

source: chefcookie_functional_cookies_labels
it: Etichette per i cookie funzionali

source: chefcookie_functional_cookies_labels_help
it: Se compilato, verrà attivato il flag per accettare o meno i cookie funzionali nel banner di consenso.

source: chefcookie_general_labels
it: Etichette generali

source: chefcookie_header_help
it: Inserisci il testo dell'intestazione del banner. Per ogni lingua del sito. Se vuoi inserire un link alla pagina della policy, usa il placeholder {policy_url}.

source: chefcookie_header_label
it: Intestazione banner di consenso

source: chefcookie_hotjar_id_help
it: Se compilato e l'utente ha accettato i cookie di HotJar, questo id verrà utilizzato per tracciare l'utente.

source: chefcookie_hotjar_id_label
it: Id HotJar

source: chefcookie_iframes_mapping_labels
it: Mappatura iframe

source: chefcookie_iframes_mapping_labels_help
it: Inserisci una lista di configurazioni per bloccare gli iframe dei vari provider. Se l'utente blocca il cookie di uno di questi, tutti gli iframe con il relativo dominio verranno bloccati di conseguenza.

source: chefcookie_linkedin_id_help
it: Se compilato e l'utente ha accettato i cookie di LinkedIn, questo id verrà utilizzato per tracciare l'utente.

source: chefcookie_linkedin_id_label
it: Id LinkedIn

source: chefcookie_links_mapping_labels
it: Mapping per la trasformazione dei link

source: chefcookie_links_mapping_labels_help
it: Inserisci una lista di mapping fra provider e una lista di classi che saranno usate come selettore dei link da trasformare

source: chefcookie_matomo_cookies_labels
it: Cookie Matomo

source: chefcookie_matomo_cookies_labels_help
it: Se compilato si abilita Matomo

source: chefcookie_matomo_id_help
it: Se settato lo user accetta di avere il tracciamento e i cookie di Matomo

source: chefcookie_matomo_id_label
it: Id Matomo

source: chefcookie_only_enable_chefcookie_help
it: Seleziona la checkbox per utilizzare chefcookie e mostrare il banner nel sito; utile per configurare il plugin prima di mostrarlo

source: chefcookie_only_technical_cookies_help
it: Seleziona se il sito utilizza solo cookie tecnici.

source: chefcookie_only_technical_cookies_label
it: Solo cookie tecnici

source: chefcookie_policy_url_help
it: Inserisci l'URL della pagina della policy dei cookie. Può essere utilizzato nel campo "Intestazione banner" con il placeholder "{policy_url}" per sostituirlo dinamicamente con l'URL fornito.

source: chefcookie_policy_url_label
it: Pagina policy

source: chefcookie_profiling_cookies_labels
it: Etichette cookie di profilazione

source: chefcookie_profiling_cookies_specific_labels
it: Etichette cookie di profilazione specifiche

source: chefcookie_profiling_cookies_specific_labels_help
it: Etichette per i singoli provider impostati. Se il relativo id/flag sono stati impsotati, questo attiverà il flag nel banner di consenso.

source: chefcookie_registry_endpoint_help
it: Se impostato, chefcookie manda dati di utilizzo del banner all'endpoint indicato; usare un percorso assoluto sulla root del sito come /@@cc_consent_registry

source: chefcookie_registry_endpoint_label
it: Endpoint per il registro delle scelte

source: chefcookie_technical_cookies_labels
it: Etichette cookie tecnici

source: iframe_placeholder_text_1
it: Devi accettare i cookie di ${name} per vedere questo contenuto.

source: iframe_placeholder_text_2
it: Per favore

source: iframe_placeholder_text_3
it: abilitali

source: iframe_placeholder_text_4
it: oppure

source: iframe_placeholder_text_5
it: gestisci le tue preferenze

source: invalid_cfg_no_dict
it: Il JSON deve essere un'oggetto

source: invalid_json
it: JSON non valito: ${message}

source: manage_cookie_settings_label
it: Gestisci impostazioni cookie

source: settings_default_label
it: Impostazioni

source: settings_labels_label
it: Etichette
